# Session 3: Data Wrangling

In [2]:
import pandas as pd

## Accessing data

In [3]:
df=pd.read_csv('Session_3_data.csv')
df

   Region  Year Quarter ProductCategory  Sales
0   North  2020      Q1     Electronics  20000
1   North  2020      Q2     Electronics  25000
2   North  2020      Q1       Furniture   6000
3   North  2020      Q2       Furniture   7000
4   North  2021      Q1     Electronics  30000
5   North  2021      Q2     Electronics  23000
6   North  2021      Q1       Furniture   8000
7   North  2021      Q2       Furniture   7000
8   South  2020      Q1     Electronics  15000
9   South  2020      Q2     Electronics  32000
10  South  2020      Q1       Furniture  10000
11  South  2020      Q2       Furniture   9000
12  South  2021      Q1     Electronics  28000
13  South  2021      Q2     Electronics  23000
14  South  2021      Q1       Furniture   9000
15  South  2021      Q2       Furniture  10500
16   East  2020      Q1        Clothing  12000
17   East  2020      Q2        Clothing  18000
18   East  2021      Q1        Clothing  22000
19   East  2021      Q2        Clothing  25000
20   West  2020      Q1        Clothing  13000
21   West  2020      Q2        Clothing  14000
22   West  2021      Q1        Clothing  24000
23   West  2021      Q2        Clothing  22000

In [4]:
df.columns

Index(['Region', 'Year', 'Quarter', 'ProductCategory', 'Sales'], dtype='object')

In [5]:
df['Region'].value_counts()

Region
North    8
South    8
East     4
West     4
Name: count, dtype: int64

In [6]:
df['Year'].value_counts()

Year
2020    12
2021    12
Name: count, dtype: int64

In [7]:
df['Quarter'].value_counts()

Quarter
Q1    12
Q2    12
Name: count, dtype: int64

In [8]:
df['ProductCategory'].value_counts()

ProductCategory
Electronics    8
Furniture      8
Clothing       8
Name: count, dtype: int64

## Creating multi-level indexing

In [10]:
df.set_index(['Region','Year','Quarter','ProductCategory'],inplace=True)
df

                                     Sales
Region Year Quarter ProductCategory
North  2020 Q1      Electronics      20000
            Q2      Electronics      25000
            Q1      Furniture         6000
            Q2      Furniture         7000
       2021 Q1      Electronics      30000
            Q2      Electronics      23000
            Q1      Furniture         8000
            Q2      Furniture         7000
South  2020 Q1      Electronics      15000
            Q2      Electronics      32000
            Q1      Furniture        10000
            Q2      Furniture         9000
       2021 Q1      Electronics      28000
            Q2      Electronics      23000
            Q1      Furniture         9000
            Q2      Furniture        10500
East   2020 Q1      Clothing         12000
            Q2      Clothing         18000
       2021 Q1      Clothing         22000
            Q2      Clothing         25000
West   2020 Q1      Clothing         13000
            Q2      Clothing         14000
       2021 Q1      Clothing         24000
            Q2      Clothing         22000

In [11]:
df.columns

Index(['Sales'], dtype='object')

## Analysis

In [12]:
# 1. Display the index names.
df.index.names

FrozenList(['Region', 'Year', 'Quarter', 'ProductCategory'])

In [13]:
# 2. Display data for the ‘North’ region

df.loc['North']

                              Sales
Year Quarter ProductCategory
2020 Q1      Electronics      20000
     Q2      Electronics      25000
     Q1      Furniture         6000
     Q2      Furniture         7000
2021 Q1      Electronics      30000
     Q2      Electronics      23000
     Q1      Furniture         8000
     Q2      Furniture         7000

In [14]:
# 3. Display data for the ‘South’ region.

df.loc['South']

                              Sales
Year Quarter ProductCategory
2020 Q1      Electronics      15000
     Q2      Electronics      32000
     Q1      Furniture        10000
     Q2      Furniture         9000
2021 Q1      Electronics      28000
     Q2      Electronics      23000
     Q1      Furniture         9000
     Q2      Furniture        10500

In [16]:
# 4. Display data for the year 2020

df.loc[2020]

KeyError: 2020

In [20]:
df.loc[:,2020,:,:]

                                Sales
Region Quarter ProductCategory
North  Q1      Electronics      20000
       Q2      Electronics      25000
       Q1      Furniture         6000
       Q2      Furniture         7000
South  Q1      Electronics      15000
       Q2      Electronics      32000
       Q1      Furniture        10000
       Q2      Furniture         9000
East   Q1      Clothing         12000
       Q2      Clothing         18000
West   Q1      Clothing         13000
       Q2      Clothing         14000

In [21]:
# 5. Display data for quarter ‘Q2’

df.loc[:,:,'Q2',:]

                             Sales
Region Year ProductCategory
North  2020 Electronics      25000
            Furniture         7000
       2021 Electronics      23000
            Furniture         7000
South  2020 Electronics      32000
            Furniture         9000
       2021 Electronics      23000
            Furniture        10500
East   2020 Clothing         18000
       2021 Clothing         25000
West   2020 Clothing         14000
       2021 Clothing         22000

In [23]:
df.loc[slice(None),slice(None),'Q2',slice(None)]

                             Sales
Region Year ProductCategory
North  2020 Electronics      25000
            Furniture         7000
       2021 Electronics      23000
            Furniture         7000
South  2020 Electronics      32000
            Furniture         9000
       2021 Electronics      23000
            Furniture        10500
East   2020 Clothing         18000
       2021 Clothing         25000
West   2020 Clothing         14000
       2021 Clothing         22000

In [24]:
# cross section .xs

df.xs(level='Quarter',key='Q2')

                             Sales
Region Year ProductCategory
North  2020 Electronics      25000
            Furniture         7000
       2021 Electronics      23000
            Furniture         7000
South  2020 Electronics      32000
            Furniture         9000
       2021 Electronics      23000
            Furniture        10500
East   2020 Clothing         18000
       2021 Clothing         25000
West   2020 Clothing         14000
       2021 Clothing         22000

In [25]:
# 6. Find the total sales for each year

df.groupby(level='Year').sum()

       Sales
Year
2020  181000
2021  231500

In [26]:
# 7. Find the mean Sales for each ProductCategory

df.groupby(level='ProductCategory').mean()

                   Sales
ProductCategory
Clothing         18750.0
Electronics      24500.0
Furniture         8312.5

In [27]:
# 8. Find the Sales for Electronics in North region in 2020 
df.loc['North',2020,:,'Electronics']

         Sales
Quarter
Q1       20000
Q2       25000

In [28]:
# 9. Find average Sales for Electronics in North region in 2020
df.loc['North',2020,:,'Electronics'].mean()

Sales    22500.0
dtype: float64

In [29]:
# 10. Which ProductCategory had more Sales in the South region for Q2 of 2021?

df.loc['South',2021,'Q2',:]

                 Sales
ProductCategory
Electronics      23000
Furniture        10500

In [30]:
df.loc['South',2021,'Q2',:].max()

Sales    23000
dtype: int64

In [31]:
df.loc['South',2021,'Q2',:].idxmax()

Sales    Electronics
dtype: object

In [32]:
# 11. What is the total sales for Furniture across all regions in 2020?

df.loc[:,2020,:,'Furniture']

                Sales
Region Quarter
North  Q1        6000
       Q2        7000
South  Q1       10000
       Q2        9000

In [33]:
df.loc[:,2020,:,'Furniture'].sum()

Sales    32000
dtype: int64

In [34]:
# 12. Find sales of all product categories  in the West region for Q2 of 2020.

df.loc['West',2020,'Q2',:]

                 Sales
ProductCategory
Clothing         14000

In [40]:
# 13. Which region had the highest sales in Electronics in 2020?

df.loc[:,2020,:,'Electronics']

                Sales
Region Quarter
North  Q1       20000
       Q2       25000
South  Q1       15000
       Q2       32000

In [41]:
df.loc[:,2020,:,'Electronics'].groupby('Region').sum()

        Sales
Region
North   45000
South   47000

In [42]:
df.loc[:,2020,:,'Electronics'].groupby('Region').sum().idxmax()

Sales    South
dtype: object

In [44]:
# 14. Find Total sales for North region in 2021 across all product categories
df.loc['North',2021,:,:].sum()

Sales    68000
dtype: int64

## Merging of DFs

In [47]:
df1=pd.DataFrame({'key':['a','a','b','b','c','d'],
                  'value1':[1,2,3,4,5,6]})
df1

  key  value1
0   a       1
1   a       2
2   b       3
3   b       4
4   c       5
5   d       6

In [48]:
df2=pd.DataFrame({'key':['a','a','b'],
                 'value2':[10,20,30]})
df2

  key  value2
0   a      10
1   a      20
2   b      30

### Merging with a common column

In [49]:
pd.merge(df1,df2)

  key  value1  value2
0   a       1      10
1   a       1      20
2   a       2      10
3   a       2      20
4   b       3      30
5   b       4      30

### Using on

In [50]:
pd.merge(df1,df2,on='key')

  key  value1  value2
0   a       1      10
1   a       1      20
2   a       2      10
3   a       2      20
4   b       3      30
5   b       4      30

## Using how

In [51]:
pd.merge(df1,df2,on='key',how='inner')

  key  value1  value2
0   a       1      10
1   a       1      20
2   a       2      10
3   a       2      20
4   b       3      30
5   b       4      30

In [52]:
pd.merge(df1,df2,on='key',how='outer')

  key  value1  value2
0   a       1    10.0
1   a       1    20.0
2   a       2    10.0
3   a       2    20.0
4   b       3    30.0
5   b       4    30.0
6   c       5     NaN
7   d       6     NaN

In [53]:
pd.merge(df1,df2,on='key',how='left')

  key  value1  value2
0   a       1    10.0
1   a       1    20.0
2   a       2    10.0
3   a       2    20.0
4   b       3    30.0
5   b       4    30.0
6   c       5     NaN
7   d       6     NaN

In [54]:
pd.merge(df1,df2,on='key',how='right')

  key  value1  value2
0   a       1      10
1   a       2      10
2   a       1      20
3   a       2      20
4   b       3      30
5   b       4      30

### Merging without a common column

In [55]:
df3=pd.DataFrame({'key1':['a','a','b','b','c','d'],
                  'value1':[1,2,3,4,5,6]})
df3

  key1  value1
0    a       1
1    a       2
2    b       3
3    b       4
4    c       5
5    d       6

In [56]:
df4=pd.DataFrame({'key2':['a','a','b'],
                 'value2':[10,20,30]})
df4

  key2  value2
0    a      10
1    a      20
2    b      30

In [57]:
pd.merge(df3,df4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [58]:
pd.merge(df3,df4,left_on='key1',right_on='key2')

  key1  value1 key2  value2
0    a       1    a      10
1    a       1    a      20
2    a       2    a      10
3    a       2    a      20
4    b       3    b      30
5    b       4    b      30

In [59]:
pd.merge(df4,df3,left_on='key2',right_on='key1')

  key2  value2 key1  value1
0    a      10    a       1
1    a      10    a       2
2    a      20    a       1
3    a      20    a       2
4    b      30    b       3
5    b      30    b       4